app/controllers/tv_series_controller.rb

	def index
    	@tv_series = Tv.includes(:shoot_locations, tv_actors: [:user]).references(:shoot_locations, tv_actors: [:user]).paginate(:page => params[:page],:per_page => RECORD_PER_PAGE).where('users.name LIKE ?', "%#{params['search']}%")
---
SELECT  `users`.* FROM `users` WHERE `users`.`type` IN ('Director') AND `users`.`id` = 1 LIMIT 1